In [ ]:
"""
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
"""

In [4]:
import pandas as pd

In [11]:
number=[4,8,15,16,23,42]

In [12]:
series=pd.Series(number)

In [13]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
"""
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.
"""

In [16]:
number2=[1,2,3,4,5,6,7,8,9,10]

In [17]:
series2=pd.Series(number2)

In [18]:
print(series2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [31]:
alphabet=['A','B','C','D','E','F','G','H','I','J']

In [32]:
series3=pd.Series(alphabet)

In [33]:
print(series3)

0    A
1    B
2    C
3    D
4    E
5    F
6    G
7    H
8    I
9    J
dtype: object

In [ ]:
"""
Q3. Create a Pandas DataFrame that contains the following data:
"""

In [23]:
data={"Name":["Alice","Bob","Claire"],
      "Age": [25,30,27],
      "Gender":["Female","Male","Female"]
     }

In [24]:
df=pd.DataFrame(data)

In [25]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
"""
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
"""

In [ ]:
"""
Data Frame in pandas are 2 dimensional labeled data structre with different columns, data frame are used to
store and manipulate data in tabular form.

Series in pandas are 1 dimesional array data structure, they are similar to python list.

The main difference between both is that Data frame store multiple columns and series only store one column this means
data frame can store more data than series. and data frame also have index number through which we can easily verify 
the label of data and also when we do series alone data the dtype is always declare at last.

example of data frame and series with above data:

"""

In [2]:
data={"Name":["Alice","Bob","Claire"],
      "Age": [25,30,27],
      "Gender":["Female","Male","Female"]
     }

In [5]:
series=pd.Series(data)

In [21]:
series['Name'] # if you include one more column to it, it will give us error

['Alice', 'Bob', 'Claire']

In [6]:
df=pd.DataFrame(data)

In [7]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [22]:
series[['Name','Age']]

Name    [Alice, Bob, Claire]
Age             [25, 30, 27]
dtype: object

In [ ]:
"""
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?
"""

In [ ]:
"""
The common function used to manipulate data in Pandas DataFrame are:
head() gets you the value from top of the data 
tail() gets you the value from the bottom of data
info() gets the info about data frame rows and columns
describe() gets you the statistic for the each column of data frame ex: Mean, Median , Mode.
loc() gets you the data with rows and column by label ex: loc(0:5)
replace() it replace the values in data frame ex: replace('Old value,'New value')
drop() to remove rows and columns from data

some practical examples are below
"""

In [8]:
df.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [12]:
df.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [14]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [15]:
df.loc[0:1]

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [ ]:
"""
Q.What is panel in pandas
"""

In [ ]:
"""
Panel in pandas are 3D labelled array of data. it is similiar to cube which have rows, colimns and layers
"""

In [ ]:
"""
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
"""

In [ ]:
"""
There are two types of mutability in pandas first one is value mutability and second one is size mutability
All three data structure DataFrame, Series, Panel all three data structure are mutbale with the value mutability,
but in size mutability DataFrame and Panle are mutable, but series are immutable
"""

In [ ]:
"""
Q7.Create a DataFrame using multiple Series. Explain with an example.
"""

In [16]:
import pandas as pd

In [23]:
series1 = pd.Series([1, 2, 3], name='A')
series2 = pd.Series([4, 5, 6], name='B')
series3 = pd.Series([7, 8, 9], name='C')

In [24]:
df=pd.DataFrame([series1,series2,series3])

In [25]:
print(df)

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [ ]:
"""
Q8. Create a series using data frame with example
"""

In [26]:
dataframe={"name":["robin","tina","rahul"],
           "class":[7,8,9],
           "age":[21,22,23]
          }

In [31]:
s=pd.Series(dataframe['name'])

In [34]:
print(s)

0    robin
1     tina
2    rahul
dtype: object

In [35]:
print(s.values)

['robin' 'tina' 'rahul']